# 24 구구단 출력
dan=int(input('출력한 구구단 단수를 입력하세요(1~9)'))
if  1 <= dan <=9:
    result = f'''
    {dan} * 1 = {dan * 1}
    {dan} * 2 = {dan * 2}
    {dan} * 3 = {dan * 3}
    {dan} * 4 = {dan * 4}
    {dan} * 5 = {dan * 5}
    {dan} * 6 = {dan * 6}
    {dan} * 7 = {dan * 7}
    {dan} * 8 = {dan * 8}
    {dan} * 9 = {dan * 9}
    '''
else:
    result = '잘못 입력하셨습니다'

print(result)

# 25 소문자를 대문자로 출력
# 문자 입력 - inout() 이용
# ASCII 코드표 - A:65, a:97 => 변환시 -32 적용
# 문자를 코드값 변환:ord
# 코드를 문자로 변환:chr
# 소문자 범위 체크:a97 ~ z122

char = input('소문자를 하나 입력하세요(a-z): ')

# 입력한 문자가 소문자인지 확인(파이썬에서 숫자로 인식)
# 97 <= ord(char) <= 122:
if len(char) ==1 and 'a' <= char <= 'z':
    #result = char.upper() #함수로 간단히 처리
    result= chr(ord(char) - 32)
else:
    result = '잘못 입력하셨습니다!!'

print(result)

len(char) = 1는 일종의 유효성 검사

# 30 - 구구단 테이블

result = f'''
          Multiplication Table
       1   2   3   4   5   6   7   8   9
-------------------------------
1|   {1*1:3d} {1*2:3d} {1*3:3d} {1*4:3d} {1*5:3d} {1*6:3d} {1*7:3d} {1*8:3d} {1*9:3d} 
2|   {2*1:3d} {2*2:3d} {2*3:3d} {1*4:3d} {1*5:3d} {1*6:3d} {1*7:3d} {1*8:3d} {1*9:3d}
3|   {3*1:3d} {3*2:3d} {3*3:3d} {1*4:3d} {1*5:3d} {1*6:3d} {1*7:3d} {1*8:3d} {1*9:3d}
4|   {4*1:3d} {4*2:3d} {4*3:3d} {1*4:3d} {1*5:3d} {1*6:3d} {1*7:3d} {1*8:3d} {1*9:3d}
5|   {5*1:3d} {5*2:3d} {5*3:3d} {1*4:3d} {1*5:3d} {1*6:3d} {1*7:3d} {1*8:3d} {1*9:3d}
6|   {6*1:3d} {6*2:3d} {6*3:3d} {1*4:3d} {1*5:3d} {1*6:3d} {1*7:3d} {1*8:3d} {1*9:3d}
7|   {7*1:3d} {7*2:3d} {7*3:3d} {1*4:3d} {1*5:3d} {1*6:3d} {1*7:3d} {1*8:3d} {1*9:3d}
8|   {8*1:3d} {8*2:3d} {8*3:3d} {1*4:3d} {1*5:3d} {1*6:3d} {1*7:3d} {1*8:3d} {1*9:3d}
9|   {9*1:3d} {9*2:3d} {9*3:3d} {1*4:3d} {1*5:3d} {1*6:3d} {1*7:3d} {1*8:3d} {1*9:3d}
'''
print(result)

# 36 시간 계산
# # 하루 86400초, 한 시간 3600초, 일 분은 60초
day_sec = 86400
hour_sec = 3600
min_sec = 60


result = f'''
{1234567890:,}초는 {1234567890 // day_sec:,}일입니다
{12345:,}초는 {12345 // hour_sec:,}시간입니다
{67890:,}초는 {67890 // min_sec:,}초입니다
'''

print(result)

